### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-09T18:23:03.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:7",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
!       s3_object_version              = "Bzv7mnh8N.hj3dxpm5Dtdu51a.BdLQFv" -> (known after apply)
        tags                           = {}
!       version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "8" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "9a971d750fcf9b6127f97e5f3de40231" -> (known after apply)
!       id                     = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> (known after apply)
!       key                    = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "Bzv7mnh8N.hj3dxpm5Dtdu51a.BdLQFv" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/app",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4285101868916975948" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
!           "timestamp" = "1691605292496274000" -> "1691606334322598000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "6533305607927039278" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:7" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-09T18:23:03.608+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:7" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_key                      = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
!       s3_object_version           = "u8MmVHkXLVy.ysDvj4IqM6YUYKvUhMd3" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "xfKY75X+aWOtbCBklqPefpWmItyOWWRLD7Bx35LyXBY=" -> (known after apply)
!       source_code_size            = 1176 -> (known after apply)
!       version                     = "7" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "482201057d0774844ef442d98ee18b7d" -> (known after apply)
!       id                     = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> (known after apply)
!       key                    = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "u8MmVHkXLVy.ysDvj4IqM6YUYKvUhMd3" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function/",
+                       null,
                    ],
                ]
+               filename      = "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4140300961708683272" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
!           "timestamp" = "1691605292474729000" -> "1691606334300176000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "6213965500262580721" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip" -> "builds/14e4eb684862617deeab81afd19c71b8161a1aa078a306960c41c60c1dfcbc87.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>